In [1]:
!pip install mysql-connector-python sqlalchemy

Collecting mysql-connector-python
  Downloading mysql_connector_python-9.5.0-cp313-cp313-manylinux_2_28_x86_64.whl.metadata (7.5 kB)
Requirement already satisfied: sqlalchemy in /home/bhupendra/anaconda3/lib/python3.13/site-packages (2.0.39)
Requirement already satisfied: greenlet!=0.4.17 in /home/bhupendra/anaconda3/lib/python3.13/site-packages (from sqlalchemy) (3.1.1)
Requirement already satisfied: typing-extensions>=4.6.0 in /home/bhupendra/anaconda3/lib/python3.13/site-packages (from sqlalchemy) (4.12.2)
Downloading mysql_connector_python-9.5.0-cp313-cp313-manylinux_2_28_x86_64.whl (34.1 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 34.1/34.1 MB 2.5 MB/s eta 0:00:00m eta 0:00:010:01:01m
Installing collected packages: mysql-connector-python
Successfully installed mysql-connector-python-9.5.0

In [26]:
import pandas as pd
from sqlalchemy import create_engine

# Connection details
user = 'root'
password = ''
host = 'localhost' # or an IP address
port = '3306'
database = 'gdb0041'

# Create the connection string
# Format: mysql+mysqlconnector://<user>:<password>@<host>[:<port>]/<dbname>
connection_str = f"mysql+mysqlconnector://{user}:{password}@{host}:{port}/{database}"

# Create the engine
engine = create_engine(connection_str)

In [ ]:
query = "SELECT * FROM dim_customer"

# Read the SQL query into a pandas DataFrame
df = pd.read_sql(query, engine)
# Display the results
df

In [ ]:
"""
    Individual product sales (aggregated on a monthly basis
    at the product code level for croma india customer for 
    FY-2021)
# """
# read_show("select * from fact_sales_monthly where customer_code = 90002002").head()
df_fact_sales_monthly = pd.read_sql("SELECT * FROM fact_sales_monthly", engine)
df_fact_sales_monthly

               date product_code  customer_code  sold_quantity
0        2017-09-01  A0118150101       70002017             51
1        2017-09-01  A0118150101       70002018             77
2        2017-09-01  A0118150101       70003181             17
3        2017-09-01  A0118150101       70003182              6
4        2017-09-01  A0118150101       70006157              5
...             ...          ...            ...            ...
1425701  2021-12-01  A7321160303       90023028            292
1425702  2021-12-01  A7321160303       90023030             46
1425703  2021-12-01  A7321160303       90024183             25
1425704  2021-12-01  A7321160303       90024184             25
1425705  2021-12-01  A7321160303       90027207             23

[1425706 rows x 4 columns]

In [52]:
df_fact_sales_monthly.columns.str.strip()

Index(['date', 'product_code', 'customer_code', 'sold_quantity'], dtype='object')

In [ ]:
df_fact_sales_monthly["date"] = pd.to_datetime(df_fact_sales_monthly["date"])
df_fact_sales_monthly["date"]

0         2017-09-01
1         2017-09-01
2         2017-09-01
3         2017-09-01
4         2017-09-01
             ...
1425701   2021-12-01
1425702   2021-12-01
1425703   2021-12-01
1425704   2021-12-01
1425705   2021-12-01
Name: date, Length: 1425706, dtype: datetime64[ns]

In [61]:
df_fact_sales_monthly["year"] = df_fact_sales_monthly.date.dt.year
df_fact_sales_monthly

              date product_code  customer_code  sold_quantity  year
0       2017-09-01  A0118150101       70002017             51  2017
1       2017-09-01  A0118150101       70002018             77  2017
2       2017-09-01  A0118150101       70003181             17  2017
3       2017-09-01  A0118150101       70003182              6  2017
4       2017-09-01  A0118150101       70006157              5  2017
...            ...          ...            ...            ...   ...
1425701 2021-12-01  A7321160303       90023028            292  2021
1425702 2021-12-01  A7321160303       90023030             46  2021
1425703 2021-12-01  A7321160303       90024183             25  2021
1425704 2021-12-01  A7321160303       90024184             25  2021
1425705 2021-12-01  A7321160303       90027207             23  2021

[1425706 rows x 5 columns]

In [ ]:
df_fact_sales_monthly["year"] = df_fact_sales_monthly.date.apply(lambda x: x)

In [ ]:
df_fact_sales_monthly[(df_fact_sales_monthly.customer_code == 90002002) & (df_fact_sales_monthly.date == 90002002) ]

               date product_code  customer_code  sold_quantity
25       2017-09-01  A0118150101       90002002             40
105      2017-10-01  A0118150101       90002002             71
250      2017-12-01  A0118150101       90002002            131
329      2018-01-01  A0118150101       90002002             31
401      2018-02-01  A0118150101       90002002             16
...             ...          ...            ...            ...
1424646  2021-06-01  A7321160303       90002002            289
1424959  2021-08-01  A7321160303       90002002            158
1425116  2021-09-01  A7321160303       90002002            759
1425273  2021-10-01  A7321160303       90002002            169
1425586  2021-12-01  A7321160303       90002002            523

[8184 rows x 4 columns]

In [49]:
df_fact_sales_monthly.date

0          2017-09-01
1          2017-09-01
2          2017-09-01
3          2017-09-01
4          2017-09-01
              ...
1425701    2021-12-01
1425702    2021-12-01
1425703    2021-12-01
1425704    2021-12-01
1425705    2021-12-01
Name: date, Length: 1425706, dtype: object